tutorials/incompressible/pimpleRemeshFoam/simple_0012/systemid5deg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          308;
        startFace       18781;
    }
    freestream
    {
        type            patch;
        nFaces          83;
        startFace       19089;
    }
    BaseAndTop
    {
        type            empty;
        inGroups        1(empty);
        nFaces          23882;
        startFace       19172;
    }
)

// ************************************************************************* //
