tutorials/incompressible/pimpleRemeshFoam/simple_0012/systemid5deg/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
11941
(
0.00032425
0.000350468
0.000285146
0.000349006
0.000382391
0.000268834
0.000255558
0.00038855
...
)
;

boundaryField
{
    airfoil
    {
        type            zeroGradient;
    }
    freestream
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
        value           uniform 0;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
