tutorials/incompressible/pimpleRemeshFoam/simple_0012/systemid5deg/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
11941
(
0.00289343
0.00236739
0.00286684
0.00181958
0.00289405
0.00203783
0.00294508
0.00180985
...
)
;

boundaryField
{
    airfoil
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
308
(
1e-15
1e-15
1e-15
1e-15
1e-15
1e-15
1e-15
1e-15
...
)
;
    }
    freestream
    {
        type            fixedValue;
        value           uniform 3.75e-05;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
