tutorials/incompressible/pimpleRemeshFoam/simple_0012/systemid5deg/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
11941
(
0.000307146
0.000302398
0.000306645
0.000296125
0.000307148
0.000298409
0.000307448
0.000295617
...
)
;

boundaryField
{
    airfoil
    {
        type            nutkWallFunction;
        value           nonuniform List<scalar> 
308
(
2.33653e-20
2.30129e-20
2.23868e-20
2.15178e-20
2.03062e-20
1.83196e-20
1.53629e-20
1.0076e-20
...
)
;
    }
    freestream
    {
        type            fixedValue;
        value           uniform 6.1605e-05;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
