tutorials/incompressible/pimpleRemeshFoam/simple_0012/systemid5deg/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
11941
(
9.41907
7.82394
9.33601
6.13941
9.42063
6.80656
9.57633
6.11039
...
)
;

boundaryField
{
    airfoil
    {
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
308
(
44410.7
44405.2
56028.7
65900.6
67537.6
97627.8
155446
223167
...
)
;
    }
    freestream
    {
        type            fixedValue;
        value           uniform 0.600601;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
